{
	"basics": {
		"name": "Connor Tangney",
		"label": "Webmaster",
		"picture": "",
		"email": "connor@cjtangney.me",
		"phone": "(603) 706-3113",
		"website": "cjtangney.me",
		"summary": "",
		"location": {
			"address": "521 Pine Street #203",
			"postalCode": "NH 03104",
			"city": "Manchester",
			"countryCode": "US",
			"region": "New Hampshire"
		}
	},
	"work": [{
			"company": "Pacific Group Resorts",
			"position": "Webmaster",
			"website": "",
			"startDate": "2018-06-01",
			"endDate": "",
			"summary": "The Webmaster for Pacific Group Resorts is responsible for overseeing all site maintenance and updates for Ragged Mountain, Wisp Resort, and Wintergreen Resort. Each website is served by a Microsoft IIS server running an instance of Episerver's Ektron CMS. Another core responsibility of the webmaster is to explore modern alternatives to help improve Pacific Group Resorts' online presence while streamlining the content creation workflow. Solutions explored have utilized technologies including MongoDB, Express, React, and Node. Secondary roles include:",
			"highlights": [
				"Integrate eCommerce tracking through the use of Google Tag Manager and their advanced eCommerce tracking module. This was achieved through modifications to ASP templates, as well as developing Javascript code to build and transmit the data layer. Some familiarity with Google Tag Manager was necessary for the successful completion of this project.",
				"Develop and re-imagine user experience for key pages of the website. One such example of this would be the rebranding of Ragged Mountain's wedding pages to ensure the look and feel of printed and digital content remained consistent. Working closely with the Marketing Director and Wedding Coordinator was crucial to ensure their needs were met.",
				"The Webmaster is also responsible for performing monthly ADA Accessibility compliance audits through the use of Google's Lighthouse Tools."
			]
		},
		{
			"company": "Ragged Mountain Resort",
			"position": "Administrative Staff: Marketing / IT",
			"website": "https://raggedmountainresort.com",
			"startDate": "2016-10-01",
			"endDate": "",
			"summary": "Ragged Mountain's administrative staff consists of a core group of professionals, often responsible for overseeing duties in multiple departments. As a member of the marketing and information technology teams, responsibilities include:",
			"highlights": [
				"Management of the resort's web presence and social media outlets.",
				"Provide remote assistance to Pacific Group's director of information technology by assisting with network upgrades, hardware troubleshooting, and responding to staff inquiries regarding their workstations.",
				"Oversee network upgrades and installations. One such installation included the implementation of an RFID ticketing system.",
				"Establish and manage on-going digital retargeting campaigns through the use of AdRoll. One such campaign resulted in a 70:1 ROI.",
				"Data abstraction of physical season passholder forms in order to create a digital database containing relevant patron demographics."
			]
		},
		{
			"company": "Global Printing",
			"position": "Data Automation Specialist",
			"website": "",
			"startDate": "2013-06-01",
			"endDate": "2016-05-01",
			"summary": "The Data Automation Specialist's primary job role was to develop automated data workflows which directly correlated to an increase in productivity by reducing “hands-on” man hours for recurring jobs. This required exceptional problem solving skills, as well as an ability to ensure that tasks were completed with high levels of accuracy. It was crucial to have an in-depth knowledge of JavaScript data transformation capabilities, as well as extensive knowledge on a number of other proprietary technologies like Objectif Lune PlanetPress. Secondary responsibilities included:",
			"highlights": [
				"Administer remote file transfer server client drop locations. Many automated workflows began by polling one of these remote locations for the existence of a given file. Workflows included error handling, such as a non-existent file or incorrect data structure.",
				"Developing additional software to assist with the workflow logic was often required. These in-house programs were often created using technologies like Java, PHP, JavaScript, AJAX, SQL, and more. One such example of this kind of software would be a utility which was created to scrub customer records from the data server following a predetermined time frame."
			]
		}
	],
	"education": [{
		"institution": "Rochester Institute of Technology",
		"area": "Media Arts and Technology",
		"studyType": "Bachelor",
		"startDate": "2010-09-01",
		"endDate": "2014-05-01"
	}],
	"skills": [{
			"name": "Web Development",
			"keywords": [
				"HTML",
				"Javascript",
				"React",
				"Mongo"
			]
		},
		{
			"name": "Data Manipulation",
			"keywords": [
				"XML",
				"JSON",
				"Javascript",
				"Mongo"
			]
		},
		{
			"name": "Design",
			"keywords": [
				"CSS",
				"Page layout",
				"Sass",
				"SCSS"
			]
		}
	],
	"languages": [{
		"language": "English",
		"fluency": "Native speaker"
	}]
}